// #3ckURgvs
//
// – Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
//
// (в першу, другу, третю або четверту частину години).

let time = +prompt('Введіть число від 0 до 59');
if (0<=time && time<15) console.log('перша частина')
else if (15<=time && time<30) console.log('друга частина')
else if (30<=time && time<45) console.log('третя частина')
else if (45<=time && time<60) console.log('четверта частина')
else console.log('не вірне значення')